{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi there",
        "How are you",
        "Is anyone there?",
        "Hey",
        "Hola",
        "Hello",
        "Good day",
        "Hey",
        "Hoi",
        "Hi"
      ],
      "responses": [
        "Hello! How can I help you today?",
        "Hey there, what brings you to our chat?",
        "Hello, thank you for reaching out to us. What can I do for you?",
        "Hi! What's on your mind today?",
        "Welcome to our chat! How can I assist you?",
        "Hello, it's great to see you! How can I be of service?",
        "Hi, thanks for contacting us. What can I help you with?",
        "Hello, I'm here to help. What can I assist you with?",
        "Hey, thanks for getting in touch. How can I assist you today?",
        "Hello, what can I help you with?",
        "Hi there, how can I make your day better?",
        "Hello, it's nice to hear from you. What brings you here?",
        "Hi, what can I help you with today?",
        "Hello, I'm here to assist you. How can I help?",
        "Hey, what can I assist you with today?",
        "Hello, thank you for contacting us. What can I do for you today?",
        "Hi there, how can I assist you with your needs today?",
        "Hello, I'm glad you're here. What can I help you with?",
        "Hi, how can I make your experience better today?",
        "Hello, what can I do for you today?"
      ]
    },

    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye", "Ok bye", "Bye Bye"],
      "responses": [
        "See you!",
        "Have a nice day",
        "Sure Bye",
        "Later dude",
        "Peace out",
        "Sure",
        "Ciao"
      ]
    },

    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "That's helpful",
        "Awesome, thanks",
        "Thanks for helping me"
      ],
      "responses": [
        "Happy to help!",
        "I hope this helps! Let me know if you have any further questions.",
        "You're welcome! Do you need help with anything else?",
        "No problem at all. It was my pleasure to assist you.",
        "You're welcome! Let me know if there's anything else I can help you with.",
        "It was my pleasure to help. Is there anything else you need assistance with?",
        "You're welcome! Feel free to contact us again if you need further assistance.",
        "Glad I could be of assistance. Is there anything else you need help with?",
        "No need to thank me, it's what I'm here for. How else can I assist you?",
        "You're welcome! If you have any further questions, don't hesitate to ask.",
        "I'm happy to help. Let me know if there's anything else you need assistance with.",
        "You're welcome! Have a great day.",
        "No problem, happy to help. Is there anything else I can do for you?",
        "You're welcome! I'm here to assist you anytime.",
        "I'm glad I could be of help. Is there anything else you need assistance with?",
        "You're welcome! Don't hesitate to contact us if you have any further questions.",
        "It's no trouble at all. Is there anything else you need help with?"
      ]
    },

    {
      "tag": "noanswer",
      "patterns": [],
      "responses": [
        "Sorry, can't understand you",
        "Please give me more info",
        "Not sure I understand",
        "I am still here",
        "Use simple words",
        "Can you elobrate more about your questions?",
        "Can you repeat the question?",
        "I'm not sure I understand what you're asking. Can you please provide more information?",
        "I'm sorry, I don't have an answer to that question."
      ]
    },

    {
      "tag": "name",
      "patterns": [
        "What is your name",
        "Whats your name",
        "Tell me your name",
        "Who are you",
        "Tell me about yourself",
        "You are",
        "What are you"
      ],
      "responses": [
        "I am a chatbot",
        "My name is NLP-Search Chatbot",
        "You can call me JC in short",
        "I am a chatbot created to help you know about KeHMIS",
        "My name is ChatBot. How can I assist you today?",
        "I'm ChatBot, nice to meet you! What can I help you with?",
        "My name is NLP-Search Chatbot and I'm here to help. What brings you here?",
        "I'm a chatbot designed to assist you. How can I be of service?",
        "My name is ChatBot, and I'm here to answer your questions. What can I help you with?",
        "I'm a chatbot here to assist you. What can I do for you today?",
        "My name is ChatBot. What can I assist you with today?",
        "I'm a chatbot designed to help you find the information you need. What would you like to know?",
        "My name is ChatBot. How can I make your experience better?",
        "I'm a chatbot here to assist you with any questions or concerns you may have. What can I help you with?"
      ]
    },

    {
      "tag": "options",
      "patterns": [
        "What do you do",
        "How can you help",
        "What do you know",
        "What is your purpose",
        "How can you help"
      ],
      "responses": [
        "I can tell you about KeHMIS",
        "Im here to help you navigate the KeHMIS website, its products, and projects.",
        "I can help you with questions pertaining KeHMIS",
        "I am here to answer your questions"
      ]
    },

    {
      "tag": "about_kehmis_1",
      "patterns": [
        "What is the Kenya Health Management Information Systems project?",
        "What is KeHMIS"
      ],
      "responses": [
        "KeHMIS is a project that aims to support the development and maintenance of health information systems in Kenya.",
        "KeHMIS is a health information initiative implemented in Kenya to improve data management and healthcare delivery."
      ]
    },

    {
      "tag": "about_kehmis_2",
      "patterns": ["Can you provide an overview of KeHMIS?"],
      "responses": [
        "KeHMIS is a comprehensive project focused on developing and maintaining health information systems in Kenya.",
        "The KeHMIS project is designed to enhance the effectiveness of healthcare by improving data collection, analysis, and use."
      ]
    },
    {
      "tag": "about_kehmis_3",
      "patterns": ["Tell me about the goals of KeHMIS."],
      "responses": [
        "The main goals of KeHMIS are to support the Ministry of Health, County Health Management Teams, and Service Delivery Partners in developing and maintaining health information systems innovations in Kenya.",
        "KeHMIS aims to strengthen the health information systems in Kenya to improve patient care, data availability, and data-driven decision-making."
      ]
    },
    {
      "tag": "about_kehmis_4",
      "patterns": [
        "Who implements KeHMIS in Kenya?",
        "Who implemeted KeHMIS in Kenya"
      ],
      "responses": [
        "KeHMIS is implemented by Palladium in Kenya.",
        "The implementation of KeHMIS is carried out by the organization Palladium within the Republic of Kenya."
      ]
    },
    {
      "tag": "about_kehmis_5",
      "patterns": ["Which organization funds KeHMIS?", "Who funds KeHMIS"],
      "responses": [
        "KeHMIS is funded by PEPFAR through the United States Centers for Disease Control and Prevention (CDC).",
        "Funding for KeHMIS is provided by PEPFAR, a program supported by the United States CDC, which focuses on global health initiatives."
      ]
    },
    {
      "tag": "about_kehmis_6",
      "patterns": ["What is PEPFAR's role in KeHMIS?"],
      "responses": [
        "PEPFAR plays a significant role in funding KeHMIS, ensuring financial support for the project.",
        "The United States CDC, through PEPFAR, provides the necessary funding to support KeHMIS and its objectives in Kenya."
      ]
    },
    {
      "tag": "about_kehmis_7",
      "patterns": [
        "How is the United States Centers for Disease Control and Prevention (CDC) involved in KeHMIS?"
      ],
      "responses": [
        "The United States Centers for Disease Control and Prevention (CDC) supports KeHMIS by providing funding through the PEPFAR program.",
        "Through its collaboration with PEPFAR, the CDC contributes to the financial support and success of KeHMIS in Kenya."
      ]
    },
    {
      "tag": "about_kehmis_8",
      "patterns": ["When did KeHMIS start?"],
      "responses": [
        "KeHMIS started in 2011 and has been implemented in three phases.",
        "The initiation of KeHMIS dates back to 2011, and it has been carried out in a phased approach since then."
      ]
    },
    {
      "tag": "about_kehmis_9",
      "patterns": ["What are the different phases of KeHMIS implementation?"],
      "responses": [
        "The different phases of KeHMIS implementation include KeHMIS I, KeHMIS II, and KeHMIS III.",
        "KeHMIS has been divided into three distinct phases: KeHMIS I, KeHMIS II, and the ongoing KeHMIS III."
      ]
    },
    {
      "tag": "about_kehmis_10",
      "patterns": ["What were the objectives of KeHMIS Phase I?"],
      "responses": [
        "KeHMIS Phase I aimed to ensure the digitization of HIV data collection paper records, deploy Health Information Systems (HIS) to HIV clinics, and migrate legacy data.",
        "During KeHMIS Phase I, efforts were made to digitize HIV data records, introduce HIS to HIV clinics, and migrate existing legacy data.",
        "The objectives of KeHMIS Phase I were to ensure the digitization of HIV data collection paper records, deploy Health Information Systems (HIS) to HIV clinics, and migrate legacy data.",
        "KeHMIS Phase I aimed to modernize data collection by digitizing HIV records, implement HIS in HIV clinics, and transfer existing data to electronic platforms."
      ]
    },
    {
      "tag": "about_kehmis_11",
      "patterns": ["What was achieved during KeHMIS Phase I?"],
      "responses": [
        "During KeHMIS Phase I, significant achievements were made such as the digitization of HIV data collection paper records, the deployment of HIS to HIV clinics, and successful migration of legacy data.",
        "KeHMIS Phase I successfully accomplished goals like digitizing HIV data records, implementing HIS in HIV clinics, and effectively migrating legacy data to new systems."
      ]
    },
    {
      "tag": "about_kehmis_12",
      "patterns": ["What were the goals of KeHMIS Phase II?"],
      "responses": [
        "The goals of KeHMIS Phase II were to extend Health Information System (HIS) coverage to address the spectrum of HIV/AIDS and scale up EMR sites for optimal data availability.",
        "KeHMIS Phase II aimed to broaden the reach of the Health Information System to cover various aspects of HIV/AIDS and expand Electronic Medical Record (EMR) sites for better data availability."
      ]
    },
    {
      "tag": "about_kehmis_13",
      "patterns": ["What progress was made during KeHMIS Phase II?"],
      "responses": [
        "KeHMIS Phase II made significant progress in extending Health Information System (HIS) coverage to address the spectrum of HIV/AIDS and scaling up EMR sites for optimal data availability.",
        "KeHMIS Phase II achieved notable milestones by expanding Health Information System coverage for HIV/AIDS and increasing the number of EMR sites, resulting in improved data availability."
      ]
    },
    {
      "tag": "about_kehmis_14",
      "patterns": ["What is the duration of KeHMIS Phase III?"],
      "responses": [
        "KeHMIS Phase III commenced in October 2021 and is expected to continue until September 2026.",
        "The ongoing KeHMIS Phase III started in October 2021 and is planned to run until September 2026."
      ]
    },
    {
      "tag": "about_kehmis_15",
      "patterns": ["What improvements are expected in KeHMIS Phase III?"],
      "responses": [
        "In KeHMIS Phase III, the main focus is to improve Health Information Systems (HIS) towards the delivery of patient-centered care and enhance data demand and use for individual-level data.",
        "KeHMIS Phase III aims to enhance Health Information Systems for patient-centered care delivery and promote the effective utilization of individual-level data through improved data demand and usage."
      ]
    },
    {
      "tag": "about_kehmis_16",
      "patterns": ["How does KeHMIS support the Ministry of Health in Kenya?"],
      "responses": [
        "KeHMIS supports the Ministry of Health in Kenya by providing tools, resources, and innovations to strengthen the health information systems.",
        "Through its initiatives, KeHMIS offers support to the Ministry of Health in Kenya to enhance the capacity and effectiveness of health information systems."
      ]
    },
    {
      "tag": "about_kehmis_17",
      "patterns": [
        "What is the role of County Health Management Teams in KeHMIS?"
      ],
      "responses": [
        "County Health Management Teams play a vital role in KeHMIS by actively engaging in the development and maintenance of health information systems at the county level.",
        "KeHMIS involves County Health Management Teams in the design, implementation, and upkeep of health information systems within their respective counties."
      ]
    },
    {
      "tag": "about_kehmis_18",
      "patterns": [
        "How does KeHMIS contribute to the development of health information systems in Kenya?"
      ],
      "responses": [
        "KeHMIS contributes to the development of health information systems in Kenya by introducing innovations and promoting best practices in data management and analysis.",
        "By introducing innovative approaches and promoting data management best practices, KeHMIS actively contributes to the advancement of health information systems in Kenya."
      ]
    },
    {
      "tag": "about_kehmis_19",
      "patterns": ["What innovations are being developed in KeHMIS?"],
      "responses": [
        "In KeHMIS, various innovations are being developed to improve health information systems, including digital tools, data analytics platforms, and interoperability solutions.",
        "KeHMIS focuses on developing innovative solutions such as digital tools, data analytics platforms, and interoperability solutions to enhance the capabilities of health information systems."
      ]
    },
    {
      "tag": "about_kehmis_20",
      "patterns": [
        "Can you explain the digitization of HIV data collection in KeHMIS?"
      ],
      "responses": [
        "The digitization of HIV data collection in KeHMIS involves converting paper-based HIV records into electronic format for improved data management and accessibility.",
        "KeHMIS emphasizes the digitization of HIV data collection, enabling the conversion of paper-based HIV records into electronic formats to enhance data management and ease of access."
      ]
    },
    {
      "tag": "about_kehmis_21",
      "patterns": ["How does KeHMIS support HIV clinics?"],
      "responses": [
        "KeHMIS supports HIV clinics by providing Health Information Systems (HIS) to streamline data management, improve patient care, and facilitate efficient reporting.",
        "Through KeHMIS, HIV clinics receive Health Information Systems (HIS) that aid in data organization, enhance patient care, and simplify reporting processes."
      ]
    },
    {
      "tag": "about_kehmis_22",
      "patterns": [
        "What is the significance of Legacy Data Migration in KeHMIS?"
      ],
      "responses": [
        "Legacy Data Migration in KeHMIS involves transferring existing data from older systems to the new Health Information Systems (HIS) to ensure data continuity and accessibility.",
        "KeHMIS focuses on migrating legacy data from previous systems to the new Health Information Systems (HIS) to maintain data consistency and enable easy access."
      ]
    },
    {
      "tag": "about_kehmis_23",
      "patterns": [
        "How does KeHMIS aim to extend its coverage to address the spectrum of HIV/AIDS?"
      ],
      "responses": [
        "KeHMIS aims to extend its coverage to address the spectrum of HIV/AIDS by incorporating comprehensive data collection, analysis, and reporting related to HIV/AIDS services.",
        "To encompass the entire spectrum of HIV/AIDS, KeHMIS strives to enhance data collection, analysis, and reporting specifically pertaining to HIV/AIDS services."
      ]
    },
    {
      "tag": "about_kehmis_24",
      "patterns": ["What is the purpose of scaling up EMR sites in KeHMIS?"],
      "responses": [
        "Scaling up EMR sites in KeHMIS involves expanding the deployment and usage of Electronic Medical Record (EMR) systems to ensure comprehensive data availability.",
        "KeHMIS focuses on expanding the reach and utilization of Electronic Medical Record (EMR) systems as part of its efforts to scale up EMR sites."
      ]
    },
    {
      "tag": "about_kehmis_25",
      "patterns": ["How does KeHMIS ensure optimal data availability?"],
      "responses": [
        "KeHMIS ensures optimal data availability by implementing robust data management strategies, data quality checks, and promoting standardized data collection practices.",
        "To ensure optimal data availability, KeHMIS emphasizes the implementation of effective data management strategies, quality checks, and standardized data collection methods."
      ]
    },
    {
      "tag": "about_kehmis_26",
      "patterns": ["What are the objectives of KeHMIS Phase III?"],
      "responses": [
        "The objectives of KeHMIS Phase III include improving Health Information Systems (HIS) towards the delivery of patient-centered care and enhancing data demand and use for individual-level data.",
        "KeHMIS Phase III aims to achieve objectives such as enhancing Health Information Systems (HIS) for patient-centered care and promoting data demand and usage at the individual level."
      ]
    },
    {
      "tag": "about_kehmis_27",
      "patterns": ["How does KeHMIS aim to deliver patient-centered care?"],
      "responses": [
        "KeHMIS strives to deliver patient-centered care by leveraging Health Information Systems (HIS) to support personalized healthcare services and improve patient outcomes.",
        "By utilizing Health Information Systems (HIS), KeHMIS aims to enhance care delivery by focusing on patient-centered approaches and achieving improved patient outcomes."
      ]
    },
    {
      "tag": "about_kehmis_28",
      "patterns": [
        "How does KeHMIS improve data demand and use for individual-level data?"
      ],
      "responses": [
        "KeHMIS improves data demand and use for individual-level data by implementing data-driven interventions, promoting data analysis, and encouraging evidence-based decision-making.",
        "To enhance the demand and utilization of individual-level data, KeHMIS emphasizes data-driven interventions, encourages data analysis, and supports evidence-based decision-making."
      ]
    },
    {
      "tag": "about_kehmis_29",
      "patterns": ["What are the expected outcomes of KeHMIS Phase III?"],
      "responses": [
        "In KeHMIS Phase III, expected outcomes include enhanced Health Information Systems (HIS), improved patient care delivery, strengthened data management practices, and increased data utilization.",
        "The anticipated outcomes of KeHMIS Phase III encompass improved Health Information Systems (HIS), enhanced patient care, strengthened data management, and increased utilization of data."
      ]
    },
    {
      "tag": "about_kehmis_30",
      "patterns": ["Tell me about the achievements of KeHMIS so far."],
      "responses": [
        "KeHMIS has achieved several accomplishments so far, including digitizing HIV data collection, deploying Health Information Systems (HIS), scaling up EMR sites, and enhancing data availability for improved healthcare delivery.",
        "Some notable achievements of KeHMIS include the digitization of HIV data collection, successful implementation of Health Information Systems (HIS), scaling up of EMR sites, and improved data availability benefiting healthcare delivery."
      ]
    },

    {
      "tag": "about_kehmis_31",
      "patterns": ["What are the solutions and services provided by KeHMIS?"],
      "responses": [
        "KeHMIS offers a range of solutions and services including clinical care solutions, a data warehouse for individual-level data, interoperability solutions for data exchange, data migration tools, capacity building, support and service desk, data analytics, and HR solutions for healthcare.",
        "The solutions and services provided by KeHMIS include client-centric digital health solutions, a data warehouse for diverse EMRs, interoperability solutions for clinical data sharing, data migration tools, capacity building, support and service desk, data analytics, and HR solutions for healthcare."
      ]
    },

    {
      "tag": "about_kehmis_32",
      "patterns": ["Who are the sub-awardees of KeHMIS?"],
      "responses": [
        "The sub-awardees of KeHMIS include Jomo Kenyatta University of Agriculture and Technology (JKUAT) and HETARK. JKUAT contributes skills and value in areas such as capacity strengthening, data demand and use, analytics, and sustenance of Health Information Systems (HIS). HETARK provides technical capabilities and organizational relationships for implementing the HRH scope and supporting mHealth solutions.",
        "The sub-awardees of KeHMIS are Jomo Kenyatta University of Agriculture and Technology (JKUAT) and HETARK. JKUAT brings a diverse set of skills and expertise in areas such as capacity strengthening, data demand and use, analytics, and sustainability of Health Information Systems (HIS). HETARK offers technical capabilities and existing organizational relationships to implement the HRH scope and maintain mHealth solutions."
      ]
    },

    {
      "tag": "about_kehmis_33",
      "patterns": ["What is the role of Palladium in KeHMIS?"],
      "responses": [
        "Palladium works with governments, businesses, and investors to support KeHMIS in developing and maintaining Health Information Systems (HIS) innovations in Kenya. They contribute their knowledge, thinking, and drive towards success to spark positive change and transform lives, businesses, societies, and economies.",
        "In KeHMIS, Palladium plays a crucial role by collaborating with governments, businesses, and investors to develop and maintain Health Information Systems (HIS) innovations. Their expertise, innovative thinking, and dedication to success enable them to create positive impact and drive transformative change."
      ]
    },

    {
      "tag": "about_kehmis_34",
      "patterns": ["What is the vision of Palladium?"],
      "responses": [
        "Palladium's vision is to be the global leaders in the development and delivery of positive impact solutions."
      ]
    },

    {
      "tag": "about_kehmis_35",
      "patterns": ["How does Palladium create a positive impact?"],
      "responses": [
        "Palladium creates a positive impact by employing collaborative approaches, systemic models, and new thinking to address the world's most pressing challenges. Their work spans across 90 countries, working with governments, businesses, and investors to drive progress and success."
      ]
    },

    {
      "tag": "about_kehmis_36",
      "patterns": [
        "What are the current projects implemented by Palladium in Kenya?"
      ],
      "responses": [
        "In Kenya, Palladium currently implements seven projects, including Kenya Health Management Information System II (KeHMIS II), County Measurement Learning and Accountability Program (CMLAP) (Tupime Kaunti), Kenya Investment Mechanism (KIM), Health Policy Plus (HP+), Australia Awards Africa (AAA), New Partnerships Initiatives (NPI) Expanding Health Partnerships (NPI EXPAND), and Regional Agriculture and Market System project (RAMS)."
      ]
    },

    {
      "tag": "about_kehmis_37",
      "patterns": [
        "What is the role of the Palladium Data Informatics and Analytical Solutions (DIAS) Regional Hub in Kenya?"
      ],
      "responses": [
        "The Palladium Data Informatics and Analytical Solutions (DIAS) Regional Hub in Kenya provides informatics, technology project management, and governance support to global projects. It serves as a hub for offering expertise and assistance in data-related aspects to various initiatives."
      ]
    },

    {
      "tag": "about_kehmis_38",
      "patterns": ["What are the Clinical Care Solutions provided by KeHMIS?"],
      "responses": [
        "KeHMIS offers client-centric digital health solutions aimed at improving service delivery, data management, and patient outcomes in resource-constrained settings."
      ]
    },

    {
      "tag": "about_kehmis_39",
      "patterns": ["What is the Data Warehouse in KeHMIS?"],
      "responses": [
        "The Data Warehouse in KeHMIS is a centralized repository for individual-level data from diverse Electronic Medical Record (EMR) systems in Kenya. It supports data analytics by providing interactive and customized data outputs for epidemic control."
      ]
    },

    {
      "tag": "about_kehmis_40",
      "patterns": ["What is the Interoperability solution provided by KeHMIS?"],
      "responses": [
        "The Interoperability solution offered by KeHMIS is a standards-based solution that enables the exchange of data between different health systems. It promotes clinical data sharing and automated reporting."
      ]
    },

    {
      "tag": "about_kehmis_41",
      "patterns": ["What are the Data Migration solutions in KeHMIS?"],
      "responses": [
        "KeHMIS specializes in the development of automated electronic data migration tools. These tools facilitate the smooth transition of data across different platforms, ensuring efficient data migration processes."
      ]
    },

    {
      "tag": "about_kehmis_42",
      "patterns": ["How does KeHMIS provide Capacity Building?"],
      "responses": [
        "KeHMIS provides professional transfer of knowledge on their Health Information Systems (HIS) products. They employ innovative and cost-saving approaches that are responsive to user needs to ensure effective capacity building."
      ]
    },

    {
      "tag": "about_kehmis_44",
      "patterns": ["What services does KeHMIS offer in Data Analytics?"],
      "responses": [
        "KeHMIS provides data collation and analysis services, transforming descriptive and predictive data into actionable insights. They work with traditional and big data to generate valuable analytics for informed decision-making."
      ]
    },

    {
      "tag": "about_kehmis_45",
      "patterns": ["What is the focus of HR for Health in KeHMIS?"],
      "responses": [
        "HR for Health in KeHMIS focuses on providing HR solutions that promote access to standardized HR profiles. This facilitates data exchange, management, and quality health services by employers and regulatory agencies."
      ]
    },

    {
      "tag": "about_kehmis_46",
      "patterns": ["How long has KeHMIS been in existence?"],
      "responses": [
        "KeHMIS has been in existence since 2011, working towards developing and maintaining Health Information Systems (HIS) innovations in Kenya."
      ]
    },

    {
      "tag": "about_kehmis_47",
      "patterns": ["What were the goals of KeHMIS Phase I?"],
      "responses": [
        "The goals of KeHMIS Phase I, implemented from 2011 to 2016, included digitizing HIV data collection, deploying Health Information Systems (HIS) to HIV clinics, and migrating legacy data to digital platforms."
      ]
    },

    {
      "tag": "about_kehmis_48",
      "patterns": ["What were the goals of KeHMIS Phase II?"],
      "responses": [
        "The goals of KeHMIS Phase II, implemented from 2016 to 2021, were to extend Health Information Systems (HIS) coverage to include the spectrum of HIV/AIDS, scale up Electronic Medical Record (EMR) sites, and improve data availability."
      ]
    },

    {
      "tag": "about_kehmis_49",
      "patterns": ["What are the goals of KeHMIS Phase III?"],
      "responses": [
        "The goals of KeHMIS Phase III, which started in October 2021 and will continue until September 2026, include improving Health Information Systems (HIS) towards patient-centered care and enhancing data demand and use for individual-level data."
      ]
    },
    {
      "tag": "about_kehmis_50",
      "patterns": ["How is KeHMIS funded?"],
      "responses": [
        "KeHMIS is implemented by Palladium and is funded by PEPFAR (the United States President's Emergency Plan for AIDS Relief) through the United States Centers for Disease Control and Prevention (CDC)."
      ]
    },

    {
      "tag": "about_kehmis_51",
      "patterns": ["What is the role of KeHMIS in the Republic of Kenya?"],
      "responses": [
        "KeHMIS plays a crucial role in supporting the Ministry of Health, County Health Management Teams, and Service Delivery Partners in developing and maintaining Health Information Systems (HIS) innovations in the Republic of Kenya."
      ]
    },

    {
      "tag": "about_kehmis_52",
      "patterns": [
        "How does KeHMIS contribute to improving healthcare delivery in Kenya?"
      ],
      "responses": [
        "KeHMIS contributes to improving healthcare delivery in Kenya by digitizing data collection, implementing Health Information Systems (HIS), enhancing data availability, and promoting the use of data for individual-level care."
      ]
    },

    {
      "tag": "about_kehmis_53",
      "patterns": ["What is the geographic coverage of KeHMIS?"],
      "responses": [
        "KeHMIS operates in the Republic of Kenya, supporting healthcare information system development and maintenance across the country's various regions."
      ]
    },

    {
      "tag": "about_kehmis_54",
      "patterns": [
        "What is the role of Jomo Kenyatta University of Agriculture and Technology in KeHMIS?"
      ],
      "responses": [
        "Jomo Kenyatta University of Agriculture and Technology (JKUAT) supports KeHMIS III by providing a mix of skillsets and value in areas such as capacity strengthening, data demand and use, analytics, and sustaining Health Information Systems (HIS)."
      ]
    },

    {
      "tag": "about_kehmis_55",
      "patterns": ["What is the role of HETARK in KeHMIS?"],
      "responses": [
        "HETARK, a registered NGO in Kenya since 2008, contributes to the delivery of KeHMIS III by providing technical capabilities and utilizing existing organizational relationships to implement the HRH scope and support mHealth solutions."
      ]
    },

    {
      "tag": "about_kehmis_56",
      "patterns": [
        "How does KeHMIS aim to transform lives, businesses, societies, and economies?"
      ],
      "responses": [
        "KeHMIS aims to transform lives, businesses, societies, and economies by leveraging their knowledge, inventive thinking, and commitment to success. Through the development and delivery of Health Information Systems (HIS) innovations, they have the power to create enduring change."
      ]
    },

    {
      "tag": "about_kehmis_57",
      "patterns": ["What are the solutions and services offered by KeHMIS?"],
      "responses": [
        "KeHMIS offers a range of solutions and services, including clinical care solutions, a data warehouse for individual-level data, interoperability solutions, data migration tools, capacity building, support and service desk, data analytics, and HR solutions for health."
      ]
    },

    {
      "tag": "about_kehmis_58",
      "patterns": ["How does KeHMIS support data analytics?"],
      "responses": [
        "KeHMIS supports data analytics by providing data collation and analysis services. They transform descriptive and predictive data, including traditional and big data, into actionable insights for informed decision-making."
      ]
    },

    {
      "tag": "about_kehmis_59",
      "patterns": [
        "What is the goal of the Regional Agriculture and Market System project (RAMS) implemented by Palladium in Kenya?"
      ],
      "responses": [
        "The goal of the Regional Agriculture and Market System project (RAMS) implemented by Palladium in Kenya is to promote agriculture and market systems, fostering economic development and growth in the region."
      ]
    },

    {
      "tag": "about_kehmis_60",
      "patterns": [
        "How does Palladium link social and commercial interests to transform lives and economies?"
      ],
      "responses": [
        "Palladium links social and commercial interests to transform lives and economies through their strategic vision. By investing in initiatives that create a positive impact, they facilitate the integration of social and commercial goals for enduring change."
      ]
    },

    {
      "tag": "about_kehmis_61",
      "patterns": [
        "What is the main goal of the County Measurement Learning and Accountability Program (CMLAP) implemented by Palladium in Kenya?"
      ],
      "responses": [
        "The main goal of the County Measurement Learning and Accountability Program (CMLAP) implemented by Palladium in Kenya, also known as Tupime Kaunti, is to enhance measurement, learning, and accountability mechanisms at the county level."
      ]
    },

    {
      "tag": "about_kehmis_62",
      "patterns": [
        "How does KeHMIS contribute to epidemic control through the Data Warehouse?"
      ],
      "responses": [
        "KeHMIS contributes to epidemic control through the Data Warehouse, which serves as a centralized repository for individual-level data from diverse Electronic Medical Record (EMR) systems."
      ]
    },

    {
      "tag": "faq_kehmis_63",
      "patterns": [
        "A report has been running for too long on KenyaEMR. How can I stop it?"
      ],
      "responses": [
        "To stop a report that has been running for too long on KenyaEMR, follow these steps:\n\n1. Log into KenyaEMR using the Admin account.\n2. Go to the home page.\n3. Click on ETL Admin.\n4. Recreate Tables and then Refresh Tables.\n5. Rerun the report again.\n\nNote: If you encounter an AJAX error, you may need to reset the kenyaemrChart entries on liquibasechangelog and restart Tomcat."
      ]
    },

    {
      "tag": "faq_kehmis_64",
      "patterns": [
        "Can't access KenyaEMR from the terminal host, but can access on the main server. What could be the issue?"
      ],
      "responses": [
        "There could be several reasons for this issue:\n\n1. Ensure you have entered the correct URL in your browser.\n2. Check for any network disconnection, such as a disconnected or cut LAN cable.\n3. Verify the network configurations at both the terminal host and the server.\n\nBy eliminating these possibilities, you can troubleshoot the issue and refresh your browser to confirm if it has been resolved."
      ]
    },

    {
      "tag": "faq_kehmis_65",
      "patterns": ["How can I edit a previous visit in KenyaEMR?"],
      "responses": [
        "To edit a previous visit in KenyaEMR, follow these steps:\n\n1. Log into KenyaEMR and search for the patient whose visit you want to edit.\n2. Click on the form you want to edit.\n3. At the bottom of the form, click on the Edit button.\n4. Make the desired changes or updates.\n5. Save the form after editing the details you want to change."
      ]
    },

    {
      "tag": "faq_kehmis_66",
      "patterns": [
        "KenyaEMR by design runs on Ubuntu environment. How can I install it?"
      ],
      "responses": [
        "To install KenyaEMR on an Ubuntu environment, please follow the instructions provided in the following link:\n\nUbuntu Server Installation Job Aid"
      ]
    },

    {
      "tag": "faq_kehmis_67",
      "patterns": [
        "Data upload to NDWH is taking forever to complete in DWAPI. What should I do?"
      ],
      "responses": [
        "If data upload to the national Data Warehouse (NDWH) is taking a long time in DWAPI, ensure you have a stable internet connection. A good internet connection is necessary for the successful completion of data upload."
      ]
    },

    {
      "tag": "faq_kehmis_68",
      "patterns": ["How do I install DWAPI on an Ubuntu machine?"],
      "responses": [
        "To install DWAPI on an Ubuntu machine for data transmission from KenyaEMR, follow the Docker container installation process. You can find resources and instructions on how to install DWAPI on Ubuntu 16.04LTS in the following link:\n\nDWAPI Installation on Ubuntu"
      ]
    },

    {
      "tag": "about_kehmis_69",
      "patterns": ["How to solve ‘openmrs is not able to start' error"],
      "responses": [
        "The following guide provides a step-by-step on how to resolve openmrs error while login to KenyaEMR; Open terminal by hold Ctrl+Alt+T. Type sudo service mysql restart, Type sudo service tomcat9 restart"
      ]
    },

    {
      "tag": "faq_kehmis_70",
      "patterns": ["How do I merge duplicate clients in KenyaEMR?"],
      "responses": [
        "To merge duplicate clients in KenyaEMR, follow these steps:\n\n1. Log in to KenyaEMR with an administrator account and navigate to the Data Manager.\n2. Click on Merge Patients Records.\n3. Select the patients you want to merge, then click on Merge Patients.\n4. Confirm that the details are correct, and then click Merge and Okay."
      ]
    },

    {
      "tag": "faq_kehmis_71",
      "patterns": ["How do I perform a manual KenyaEMR database backup?"],
      "responses": [
        "To perform a manual KenyaEMR database backup, open the terminal window (Ctrl+Alt+T) and run the following command:\n\nmysqldump -u root -p openmrs | gzip > openmrs_backup_facilityname_date.sql.gz\n\nPress ENTER.\n\nNote: You will find the database dump in your home directory."
      ]
    },

    {
      "tag": "faq_kehmis_72",
      "patterns": ["How do I update missing Regimen lines in KenyaEMR?"],
      "responses": [
        "Following an update on KenyaEMR, users are expected to update regimen lines for all clients. This can be done either manually or by updating the regimen lines in bulk using a spreadsheet module."
      ]
    },

    {
      "tag": "faq_kehmis_73",
      "patterns": ["How do I upgrade KenyaEMR to a higher version?"],
      "responses": [
        "From time to time, you'll need to upgrade your instance of KenyaEMR to respond to improvements and revisions in HIV care or to fix resolved bugs."
      ]
    },

    {
      "tag": "contact_kehmis_80",
      "patterns": ["What is the location of the KeHMIS office?"],
      "responses": [
        "The KeHMIS office is located at Morningside Office Park, 3rd Floor, Ngong Road, Nairobi, Kenya."
      ]
    },

    {
      "tag": "contact_kehmis_81",
      "patterns": ["What is the mailing address for KeHMIS?"],
      "responses": [
        "The mailing address for KeHMIS is P.O. Box 3170-00100, Nairobi, Kenya."
      ]
    },

    {
      "tag": "contact_kehmis_82",
      "patterns": ["What is the phone number for KeHMIS?"],
      "responses": ["The phone number for KeHMIS is +254 717 969471."]
    },

    {
      "tag": "contact_kehmis_83",
      "patterns": ["What is the email address for KeHMIS support?"],
      "responses": [
        "The email address for KeHMIS support is help@palladiumgroup.on.spiceworks.com."
      ]
    }
  ]
}
